app/controllers/todos_controller.rb

  def index
    @todos = Todo.where user_id = @current_user.id
---
SELECT `todos`.* FROM `todos` WHERE `todos`.`user_id` = 1

  def create
    @todo = Todo.new(todo_params)
    @todo.user_id = @current_user.id
    @todo.save!
---
INSERT INTO `todos` (`content`, `user_id`, `created_at`, `updated_at`) VALUES (?, ?, ?, ?)  [["content", "boom"], ["user_id", 1], ["created_at", "2015-07-03 00:49:26"], ["updated_at", "2015-07-03 00:49:26"]]